# @Time: 2022/10/23 22:21
# @Author: 李树斌
# @File : name_list.py
# @Software :PyCharm
import random
from random import choice
import time

# import BME1_name_list
name_lists = [

    "刘瑾瑄 2110130035",
    "江若阳 2110130076",
    "林煜泰 2110130085",
    "叶倩 2110130053",
    "许丹 2110130092",
    "雍雨辰 2110130002",
    "周圳 2110130022",
    "肖洲颖 2110130063",
    "洪梦瑶 2110130021",
    "郭莹莹 2110130070",
    "黄芯悦 2110130031",
    "陈虹妃 2110130038",
    "刘石珍 2110130045",
    "李树斌 2110130025",
    "阳梓璇 2110130027",
    "张瑞 2110130059",
    "潘文静 2110130047",
    "蒋炆李 2110130032",
    "温欣欣 2110130077",
    "王子洋 2110130064",
    "周碧莲 2110130084",
    "杨堃诚 2110130096",
    "罗钰麟 2110130015",
    "钟景珊 2110130081",
    "晁菱阳 2110130014",
    "张智豪 2110130003",
    "曾洁欣 2110130005",
    "王钰纯 2110130048",
    "黄晓彤 2110130051",
    "赖文佩 2110130068",
    "薛欣怡 2110130008",
    "林鑫磊 2110130026",
    "张文鑫 2110130029",
    "黄斐珍 2110130088",
    "沈连杰 2110130104",
    "王泽宏 2110130102",
    "杨静雯 2110130044",
    "刘芷晴 2110130072",
    "郭祺峰 2110130036",
    "李福安 2110130093",
    "罗博文 2110130089",
]
print("\n\t\t\t本次摇号公平、公正、公开\n")

print("\t\t\t参与本次摇号人数43人")

lucky_dogs_needed = int(input("\t需摇出人数："))
print('\n')
lucky_dogs = []

lucky_dogs_num = 1
while lucky_dogs_num <= lucky_dogs_needed:
    lucky_dog = random.choice(name_lists)
    if lucky_dog not in lucky_dogs:
        lucky_dogs.append(lucky_dog)
        print(f"\t\t\t{lucky_dogs_num}.{lucky_dog}")
        lucky_dogs_num += 1

input("\n\t\t\t抽签结束！")